-- Практична робота 9
-- Формування запитів з групуванням даних
-- Варіант №1 — Бібліотека
-- Студент: Ілля Басалик
-- Група: IT-31


-- =========================================================
-- Завдання 1. GROUP BY за одним стовпцем
-- =========================================================

SELECT
    book_id,
    COUNT(*) AS кількість_позик
FROM loans
GROUP BY book_id;

-- Результат:
-- book_id | кількість_позик
-- 1       | 2
-- 2       | 2
-- 3       | 2
-- 4       | 1
-- 5       | 1
-- 6       | 1


-- =========================================================
-- Завдання 2. JOIN + GROUP BY
-- =========================================================

SELECT
    books.title AS назва_книги,
    COUNT(loans.id) AS кількість_позик
FROM books
LEFT JOIN loans
    ON loans.book_id = books.id
GROUP BY books.id;

-- Результат:
-- Кобзар           | 2
-- Тигролови        | 2
-- Місто            | 2
-- Захар Беркут     | 1
-- Лісова пісня     | 1
-- Чорна рада       | 1
-- Тестова книга    | 0
-- Книга без видачі | 0


-- =========================================================
-- Завдання 3. Кілька агрегатних функцій
-- =========================================================

SELECT
    books.title AS назва_книги,
    COUNT(loans.id) AS кількість_позик,
    AVG(books.copies_count) AS середня_кількість_примірників
FROM books
LEFT JOIN loans
    ON loans.book_id = books.id
GROUP BY books.id;

-- Результат:
-- Кобзар           | 2 | 5
-- Тигролови        | 2 | 3
-- Місто            | 2 | 4
-- Захар Беркут     | 1 | 6
-- Лісова пісня     | 1 | 4
-- Чорна рада       | 1 | 6
-- Тестова книга    | 0 | 0
-- Книга без видачі | 0 | 1


-- =========================================================
-- Завдання 4. GROUP BY за двома стовпцями
-- =========================================================

SELECT
    reader_id,
    book_id,
    COUNT(*) AS кількість_позик
FROM loans
GROUP BY reader_id, book_id
ORDER BY reader_id, book_id;

-- Результат:
-- 9 рядків.
-- У кожній групі кількість позик дорівнює 1.


-- =========================================================
-- Завдання 5. Стовпець поза GROUP BY
-- =========================================================

SELECT
    book_id,
    loan_date,
    COUNT(*) AS кількість_позик
FROM loans
GROUP BY book_id;

-- Результат першого запуску:
-- 1 | 2026-09-10 | 2
-- 2 | 2026-09-11 | 2
-- 3 | 2026-09-12 | 2
-- 4 | 2026-09-13 | 1
-- 5 | 2026-09-14 | 1
-- 6 | 2026-09-15 | 1

-- Результат другого запуску був таким самим.
-- SQLite дозволяє вибирати loan_date, хоча цей стовпець
-- не входить до GROUP BY і не є агрегатним.
-- Значення береться з одного з рядків відповідної групи,
-- тому покладатися на нього як на гарантоване значення не можна.