-- 1)
SELECT capacity, price_per_night, type, status FROM rooms;

-- 2|1200.0|Люкс|Вільно
-- 1|950.0|Люкс|Заброньовано
-- 3|1200.0|Стандарт|Заброньовано
-- 2|1200.0|Люкс|Заброньовано
-- 1|500.0|Стандарт|Вільно
-- 2|1050.0|Стандарт|


-- 2)
SELECT price_per_night FROM rooms WHERE price_per_night < 1000;

-- 950.0
-- 500.0


-- 3)
SELECT * from rooms LIMIT 4;

-- 1|Люкс|Вільно|1200.0|2
-- 2|Люкс|Заброньовано|950.0|1
-- 3|Стандарт|Заброньовано|1200.0|3
-- 4|Люкс|Заброньовано|1200.0|2


-- 4)
SELECT * FROM rooms WHERE status IS NULL;

-- 6|Стандарт||1050.0|2

SELECT * FROM rooms WHERE status IS NOT NULL;

-- 1|Люкс|Вільно|1200.0|2
-- 2|Люкс|Заброньовано|950.0|1
-- 3|Стандарт|Заброньовано|1200.0|3
-- 4|Люкс|Заброньовано|1200.0|2
-- 5|Стандарт|Вільно|500.0|1

-- NULL означає що значення нема або поки невідоме. Перевіряти NULL через "= NULL" не можна, тому що NULL не є звичайним значенням, а позначає відсутність значення. Для перевірки потрібно використовувати "IS NULL" або "IS NOT NULL".


-- 5)
SELECT * FROM rooms WHERE price_per_night < 800 AND capacity = 1;

-- 5|Стандарт|Вільно|500.0|1